---
kind: other
id: Methods.T:Autodesk.Revit.DB.FillPatternElement
source: html/daa25a70-101a-a563-4ba5-3652fb2d65c9.htm
---
# FillPatternElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.